DataProcessors/бит_АРМКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_АРМКассира</Name>
			<Comment>Автоматизированное рабочее место Кассира</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьИтогАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьИтог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/бит_ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_бу_ОплатаБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_ОплатаБиллинговыхУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/бит_АРМКассира/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мСписокФизЛиц;    // Хранит список физ лиц.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_УслугиЖКХ5Нажатие(Элемент)
	
	Заголовок = Элемент.Заголовок;
	ТекстВопроса = "Открыть кассовую смену?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытиеКассовойСменыНажатиеЗавершение", ЭтотОбъект, Новый Структура("ТекстВопроса, Заголовок", ТекстВопроса, Заголовок)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеКассовойСменыНажатиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСменуПослеВыбораУстройства", ЭтотОбъект);
		МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"), 
			Истина,,Объект.Касса);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСменуПослеВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЭтотОбъект.Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ДополнительныеПараметры = Новый Структура();
	Если МенеджерОборудованияКлиентПовтИсп.ИспользуетсяПодсистемыФискальныхУстройств() Тогда
		МодульКассовыеСменыКлиентПереопределяемый = МенеджерОборудованияКлиентПовтИсп.ОбщийМодуль("КассовыеСменыКлиентПереопределяемый");
		МодульКассовыеСменыКлиентПереопределяемый.УправлениеФУЗаполнитьДополнительныеПараметрыПередОткрытиемСмены(РезультатВыбора, ДополнительныеПараметры);
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, РезультатВыбора,, ДополнительныеПараметры);
	//МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор,,,,Объект.Касса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешна завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПанельПоискаАдрес.Видимость = Истина;
	Элементы.ПанельПоискаОтветственный.Видимость = Ложь;
	Элементы.ПанельПоискаЛицевойСчет.Видимость = Ложь;
	
	ОборудованиеПодключено = Истина;
	
	Объект.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	
	ОбновитьПараметрыЖКХ();
	
	Объект.Касса = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("бит_ОсновнаяКассаККМ",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	глКассаККМ = Объект.Касса;
	
	Если НЕ ЗначениеЗаполнено(Объект.Касса) Тогда
		Объект.Касса = НайтиКассуОрганизации(Объект.Организация);
	КонецЕсли; 
	
	УстановитьВидимость();
	
	УстановкаОтбораЧекККМ();
	
КонецПроцедуры

// Процедура Установка отбора таб части чеки ккм.
//
&НаКлиенте
Процедура УстановкаОтбораЧекККМ()
	
	ЧекиККМ.Отбор.Элементы.Очистить();
	
	Эл = ЧекиККМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ответственный");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный"
														,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = ЧекиККМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Касса");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Касса;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = ЧекиККМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Архивный");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Ложь;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = ЧекиККМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Ложь;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РазбитьОплатуКУПоДатам", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(ТекущаяДата()), Объект.Организация, ПараметрыЖКХ);
	
	мРазделитьОплату = ПараметрыЖКХ.РазбитьОплатуКУПоДатам;
	
КонецПроцедуры

// Процедура управляет видимостью элементов формы.
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.СуммаПриход.Видимость            = Объект.ОтображатьИтог;
	Элементы.КоличествоЧеков.Видимость        = Объект.ОтображатьИтог;
	
	Элементы.ОплатаБУ.Видимость        = Истина;
	Элементы.НачисленияБУ.Видимость    = Истина;
	
	РольДоступна = РольДоступнаНаСервере("ПолныеПрава");
	
	Если РольДоступна Тогда
		
		Элементы.ОплатаБУ.Видимость        = Истина;
		Элементы.НачисленияБУ.Видимость    = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция РольДоступнаНаСервере(Роль)
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Возврат РольДоступна(Роль);	
	
КонецФункции	

&НаКлиенте
Процедура ПоискАдрес(Команда)
	
	Элементы.ПанельПоискаАдрес.Видимость = Истина;
	Элементы.ПанельПоискаОтветственный.Видимость = Ложь;
	Элементы.ПанельПоискаЛицевойСчет.Видимость = Ложь;
	
	ЛицевыеСчета.Отбор.Элементы.Очистить();
	Элементы.ЛицевыеСчета.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТекущихНачислений(Команда)
	
	ТекЛицевойСчет = Элементы.ЛицевыеСчета.ТекущаяСтрока;
	
	Если ТекЛицевойСчет <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",ТекЛицевойСчет);
		ПараметрыФормы.Вставить("КлючНазначенияИспользования","АРМКассира");
		
		Форма = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаЭлементаУправляемая",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСумму(Команда)
	
	ОчиститьСообщения();
	
	ОписаниеОшибки = "";
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Заголовок",Заголовок);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВнестиСуммуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ФискальныйРегистратор",
		НСтр("ru = 'Выберите фискальный регистратор'"), НСтр("ru = 'Фискальный регистратор не подключен.'"));
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтог(Команда)
	
	Элементы.ОтобразитьИтог.Пометка = ?(Элементы.ОтобразитьИтог.Пометка, Ложь, Истина);
	Объект.ОтображатьИтог = Элементы.ОтобразитьИтог.Пометка;
	
	Элементы.СуммаПриход.Видимость            = Элементы.ОтобразитьИтог.Пометка;
	Элементы.КоличествоЧеков.Видимость        = Элементы.ОтобразитьИтог.Пометка;
	
	Если Элементы.ОтобразитьИтог.Пометка Тогда
		
		РасчетИтогов();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнАвто(Команда)
	
	Элементы.ОбнАвто.Пометка             = ?(Элементы.ОбнАвто.Пометка, Ложь, Истина);
	Объект.ОбновлятьИтогАвтоматически = Элементы.ОбнАвто.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	РасчетИтогов();
	
КонецПроцедуры

// Процедура выполняет расчет итогов по чекам.
//
&НаСервере
Процедура РасчетИтогов()
	
	мОтветсвенный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	СуммаПриход     = 0;
	КоличествоЧеков = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ЧекККМ.Ссылка) КАК КоличествоЧеков,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЧекККМ.Возврат)
	|				ТОГДА -бит_ЧекККМ.СуммаОплаты
	|			ИНАЧЕ бит_ЧекККМ.СуммаОплаты
	|		КОНЕЦ) КАК СуммаОплаты
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|ГДЕ
	|	бит_ЧекККМ.Касса = &Касса
	|	И (НЕ бит_ЧекККМ.ПометкаУдаления)
	|	И бит_ЧекККМ.Ответственный = &Ответственный
	|	И (НЕ бит_ЧекККМ.Архивный)";
	
	Запрос.УстановитьПараметр("Касса", Объект.Касса);
	Запрос.УстановитьПараметр("Ответственный" , мОтветсвенный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СуммаПриход     = Выборка.СуммаОплаты;
		КоличествоЧеков = Выборка.КоличествоЧеков;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		ТекстПредупреждения = НСтр("ru = 'Перед завершением работы необходимо закрыть ""Рабочее место кассира"".'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ТаблицаЧековКоличество = ПолучитьТаблицуЧеков();
	
	Если НЕ ОтрицательныйОтвет
		И ТаблицаЧековКоличество >0 тогда
		ТекстВопроса = "В базе присутствуют неархивированные чеки."+Символы.ПС+
		"Рекомендуется сначала создать документ ""Оплата КУ""."+Символы.ПС+
		" Создать его сейчас? (Отмена - Не выходить из программы)";
		Отказ = Истина;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ПередЗакрытиемФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        
        Если мРазделитьОплату Тогда
            
            РазбитьОплатаКУПоДатамНаСервере(Ложь);
        Иначе
            
            СоздатьОплатаКУНаСервере(Ложь);
        КонецЕсли; 
        
		Закрыть();
        
    ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ОтрицательныйОтвет = Истина;
		Закрыть();
        
    КонецЕсли;
    
    ПередЗакрытиемФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемФрагмент()
    
    Перем НастройкиОтображенияАРМ;
    
    НастройкиОтображенияАРМ = Новый Структура("ОтображатьИтог,ОбновлятьИтогАвтоматически",Объект.ОтображатьИтог,Объект.ОбновлятьИтогАвтоматически);

КонецПроцедуры

// Процедура возвращает таблицу чеков за кассовую смену.
//
&НаСервере
Функция ПолучитьТаблицуЧеков()
	
	мОтветсвенный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ТабЧеков = Новый ТаблицаЗначений;
	ТабЧеков.Колонки.Добавить("Чек", 	Новый ОписаниеТипов("ДокументСсылка.бит_ЧекККМ"));
	ТабЧеков.Колонки.Добавить("Дата", 	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЧекККМ.Ссылка КАК Чек,
	|	бит_ЧекККМ.Дата КАК Дата
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|ГДЕ
	|	(НЕ бит_ЧекККМ.Архивный)
	|	И (НЕ бит_ЧекККМ.ПометкаУдаления)
	|	И бит_ЧекККМ.Касса = &Касса
	|	И бит_ЧекККМ.Ответственный = &Ответственный
	|	И бит_ЧекККМ.Проведен";
	
	Запрос.УстановитьПараметр("Касса"         , Объект.Касса);
	Запрос.УстановитьПараметр("Ответственный" , мОтветсвенный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Чек.ЧекПробитНаККМ Тогда
			
			НоваяСтрока = ТабЧеков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			
		Иначе
			
			Чек = Выборка.Чек.ПолучитьОбъект();
			Попытка
				
				Чек.УстановитьПометкуУдаления(Истина);
				Чек.Записать(РежимЗаписиДокумента.Запись);
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабЧеков.Количество();
	
КонецФункции 

&НаСервере
Процедура РазбитьОплатаКУПоДатамНаСервере(Отказ)
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_АРМКассира"));
	
	ОбработкаОбъект.РазбитьОплатаКУПоДатам(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОплатаКУНаСервере(Отказ)
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_АРМКассира"));
	
	ОбработкаОбъект.СоздатьОплатаКУ(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	глКассаККМ = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПараметрыЖКХ" Тогда
		
		ОбновитьПараметрыЖКХ();
		
	КонецЕсли; 
	
	Если ИмяСобытия = "НовыйЧекПроведен" Тогда
		
		УстановкаОтбораЧекККМ();	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		КассаОрганизации = НайтиКассуОрганизации(ВыбранноеЗначение); 
		Если Объект.Касса  <> КассаОрганизации Тогда
			Объект.Касса = КассаОрганизации;
		КонецЕсли;
	Иначе
		Объект.Касса = ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
	КонецЕсли;
	
	УстановкаОтбораЧекККМ();	
	глКассаККМ = Объект.Касса;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Касса = ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
	КонецЕсли;	
	УстановкаОтбораЧекККМ();	
	глКассаККМ = Объект.Касса;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиКассуОрганизации(Организация)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_КассыККМ.Ссылка КАК КассаККМ
	               |ИЗ
	               |	Справочник.бит_КассыККМ КАК бит_КассыККМ
	               |ГДЕ
	               |	НЕ бит_КассыККМ.ПометкаУдаления
	               |	И бит_КассыККМ.Владелец = &Организация
	               |	И НЕ бит_КассыККМ.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.бит_ПодразделенияОрганизаций.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	бит_КассыККМ.Код";
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КассаККМ;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КассаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодразделениеОрганизации = ПодразделениеОрганизацииНаСервере(ВыбранноеЗначение);
	Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'У кассы: %1 не указанно подразделение организации!'"),
							ВыбранноеЗначение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Элемент.Значение = ПредопределенноеЗначение("Справочник.бит_КассыККМ.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделениеОрганизацииНаСервере(Организация)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ПодразделениеОрганизации");	
	
КонецФункции

// Процедура создает новый документ Чек ККМ.
//
&НаКлиенте
Процедура СоздатьНовыйЧек(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Касса) Тогда
		ТекстСообщения = НСтр("ru = 'Для создания чеков необходимо указать кассу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Для создания чеков необходимо указать организацию.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	ПарметрыФормы = Новый Структура;
	ПарметрыФормы.Вставить("Касса",Объект.Касса);
	ПарметрыФормы.Вставить("Организация",Объект.Организация);
	
	Форма = ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаДокументаУправляемая",Новый Структура("ЗаполнитьИзДокументаЧекККМ",ПарметрыФормы),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиККМ2ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = истина;
	СоздатьНовыйЧек(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиККМ2ПриИзменении(Элемент)
	
	Если Объект.ОбновлятьИтогАвтоматически Тогда
		
		РасчетИтогов();
		
	КонецЕсли; 
	
	Элементы.ОбнАвто.Доступность = Объект.ОтображатьИтог;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиККМ2ПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.ЧекПробитНаККМ Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Чек пробит на кассе. Установка пометки на удаление невозможна.");
			
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	УстановкаОтбора(ЛицевыеСчета, "УлицаЛицевогоСчета", Объект.Улица);
	
	Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
	Объект.Квартира = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	
	Элементы.ЛицевыеСчета.Обновить();
	
КонецПроцедуры

// Процедура управляет отбором табличных частей формы.
//
&НаКлиенте
Процедура УстановкаОтбора(ОтборОбъект,ЭлементОтбора, ЗначениеОтбора)
	
	ОтборОбъект.Отбор.Элементы.очистить();
	
	Эл = ОтборОбъект.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ЭлементОтбора);
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = ЗначениеОтбора;
	Эл.Использование    = ?(ЗначениеЗаполнено(ЗначениеОтбора),Истина,Ложь);
	
	Если Эл.Использование Тогда
		
		Эл.ПравоеЗначение      = ЗначениеОтбора;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	УстановкаОтбора(ЛицевыеСчета ,"Здание" , Объект.Здание);
	
	Объект.Квартира = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Улица",Объект.Улица);
	
	ФормаВыбор = ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("ОтборПоУлице",ПараметрыФормы),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧекККМНажатие(Элемент)
	
	СоздатьНовыйЧек(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧекККМ1Нажатие(Элемент)
	
	СоздатьНовыйЧек(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены1Нажатие(Элемент)
	
	Отказ = ЛОЖЬ;
	
	Если мРазделитьОплату Тогда
		РазбитьОплатаКУПоДатамНаСервере(Отказ);
	Иначе
		СоздатьОплатаКУНаСервере(Отказ)
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСменыНажатие(Элемент)
	
	Отказ = ЛОЖЬ;
	
	Если мРазделитьОплату Тогда
		РазбитьОплатаКУПоДатамНаСервере(Отказ);
	Иначе
		СоздатьОплатаКУНаСервере(Отказ)
	КонецЕсли; 
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.бит_ЧекККМ"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКУ1Нажатие(Элемент)
	
	Форма = ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаСпискаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКУНажатие(Элемент)
	
	Форма = ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаСпискаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПКО1Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		Форма = ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаСписка",,Элемент);
		Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("бит_КассаККМ");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Касса;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите кассу ККМ.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПКОНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		Форма = ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаСписка",,Элемент);
		Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("бит_КассаККМ");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Касса;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Укажите кассу ККМ.";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКассамККМ1Нажатие(Элемент)
	
	ОткрытьФорму("Отчет.бит_ОтчетыПоКассе.Форма.ФормаОтчетаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКассамККМНажатие(Элемент)
	
	ОткрытьФорму("Отчет.бит_ОтчетыПоКассе.Форма.ФормаОтчетаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧек(Заголовок)
	
	ОчиститьСообщения();
	ЭтотОбъект.Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации);

	//Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
	//	
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("Заголовок",Заголовок);
	//	
	//	ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//	ПоддерживаемыеТипыВО = Новый Массив();
	//	ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	//	ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	//	ПоддерживаемыеТипыВО.Добавить("ККТ");
	//	
	//	МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
	//	НСтр("ru = 'Выберите фискальный регистратор'"), НСтр("ru = 'Фискальный регистратор не подключен.'"),,,,Объект.Касса);
	//Иначе
	//	ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекЗавершение(ИдентификаторУстройства, ДополнительныеПараметры) Экспорт
	
	Заголовок = ДополнительныеПараметры.Заголовок;
	
	ОписаниеОшибки = "";
	
	// Подключаем ФР.
	Если ЗначениеЗаполнено(ИдентификаторУстройства)Тогда 
		// Готовим данные.
		ВходныеПараметры    = Новый Массив();
		ВыходныеПараметры   = Неопределено;
		
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(ИдентификаторУстройства);
		НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		
		ПодготовитьТаблицуПоСтавкамНДС(ВходныеПараметры, НомерСекции);
		
		Если Заголовок = "Отчет кассовой смены без гашения" Тогда
			
			Контекст = Новый Структура();
			Контекст.Вставить("МассивЧеков", ВходныеПараметры);
			Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
			
			Оповещение = Новый ОписаниеОповещения("НапечататьОдинЧекЗавершение", ЭтотОбъект, Контекст);
			
			МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
			УникальныйИдентификатор, 
			ВходныеПараметры, 
			ИдентификаторУстройства,
			,
			,
			);

			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор);

			
		ИначеЕсли Заголовок = "Закрытие кассовой смены Z-отчет"
			ИЛИ Заголовок = "Закрытие кассовой смены" Тогда
			
			ОчиститьСообщения();
			ЭтотОбъект.Доступность = Ложь;
			
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
			ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
			МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации);
		КонецЕсли;
		
		// Отключаем ФР.
		//!!!МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);.
	Иначе
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Чек не напечатан на фискальном регистраторе.
		|Дополнительное описание:
		|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьОдинЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Параметры.МассивЧеков.Удалить(0);
		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		
		Если Параметры.МассивЧеков.Количество() > 0 Тогда
			НапечататьЧекЗавершение(Параметры.МассивЧеков, Параметры.ИдентификаторУстройства);
		Иначе
			Модифицированность = Истина;
			
		КонецЕсли;
	Иначе
		
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном устройстве.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСуммуЗавершение(ИдентификаторУстройства, ДополнительныеПараметры) Экспорт
	
	ОписаниеОшибки = "";
	
	// Подключаем ФР.
	Результат = Истина;
	
	Если Результат Тогда
		// Готовим данные.
		ВходныеПараметры    = Новый Массив();
		ВыходныеПараметры   = Неопределено;
		
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(ИдентификаторУстройства);
		
		КоличествоФР = 1;
		
		Отказ = Истина;	
		
		Если КоличествоФР = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для выбранной кассы не подключен фискальный регистратор";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		ИначеЕсли КоличествоФР = 1 Тогда
			
			Отказ = Ложь;
		КонецЕсли;	
		
		Если КоличествоФР = 1 Тогда
			
			Сумма = Неопределено;
			ПоказатьВводЧисла(Новый ОписаниеОповещения("ВнестиСуммуЗавершениеЗавершение", ЭтотОбъект, Новый Структура("ИдентификаторУстройства, ОписаниеОшибки, ПараметрыУстройства, Сумма", ИдентификаторУстройства, ОписаниеОшибки, ПараметрыУстройства, Сумма)), Сумма, "Необходимо ввести сумму", 15, 2);
			Возврат;
		КонецЕсли;
		ВнестиСуммуЗавершениеФрагмент(ИдентификаторУстройства);
	Иначе
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Чек не напечатан на фискальном регистраторе.
		|Дополнительное описание:
		|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСуммуЗавершениеЗавершение(Число, ДополнительныеПараметры1) Экспорт
	
	ИдентификаторУстройства = ДополнительныеПараметры1.ИдентификаторУстройства;
	ОписаниеОшибки = ДополнительныеПараметры1.ОписаниеОшибки;
	ПараметрыУстройства = ДополнительныеПараметры1.ПараметрыУстройства;
	Сумма = ?(Число = Неопределено, ДополнительныеПараметры1.Сумма, Число);
	
	Если (Число <> Неопределено) Тогда
		
		Пароль    = ПараметрыУстройства.ПарольПользователя;
		
	КонецЕсли;
	
	ВнестиСуммуЗавершениеФрагмент(ИдентификаторУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСуммуЗавершениеФрагмент(Знач ИдентификаторУстройства)
	
	//!!!МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);.
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТаблицуПоСтавкамНДС(ВходныеПараметры, НомерСекции)
	
	ТаблицаПлатежей = Новый ТаблицаЗначений();
	ТаблицаПлатежей.Колонки.Добавить("Сумма");
	ТаблицаПлатежей.Колонки.Добавить("СуммаНДС");
	ТаблицаПлатежей.Колонки.Добавить("НДС");
	
	СтрокаТаблицы          = ТаблицаПлатежей.Добавить();
	СтрокаТаблицы.Сумма    = 0;
	СтрокаТаблицы.СуммаНДС = 0;
	СтрокаТаблицы.НДС      = 0;
	
	ТаблицаПлатежей.Свернуть("НДС", "Сумма, СуммаНДС");
	
	// Подготовка таблицы товаров.
	ТаблицаТоваров = Новый Массив();
	
	Для каждого Позиция Из ТаблицаПлатежей Цикл
		СтрокаТаблицыТоваров = Новый СписокЗначений();
		СтрокаТаблицыТоваров.Добавить("");                       //  1 - Наименование.
		СтрокаТаблицыТоваров.Добавить("");                       //  2 - Штрихкод.
		СтрокаТаблицыТоваров.Добавить("");                       //  3 - Артикул.
		СтрокаТаблицыТоваров.Добавить(НомерСекции);              //  4 - Номер отдела.
		СтрокаТаблицыТоваров.Добавить(Позиция.Сумма);            //  5 - Цена за позицию без скидки.
		СтрокаТаблицыТоваров.Добавить(1);                        //  6 - Количество.
		СтрокаТаблицыТоваров.Добавить("");                       //  7 - Наименование скидки/наценки.
		СтрокаТаблицыТоваров.Добавить(0);                        //  8 - Сумма скидки/наценки.
		СтрокаТаблицыТоваров.Добавить(0);                        //  9 - Процент скидки/наценки.
		СтрокаТаблицыТоваров.Добавить(Позиция.Сумма);            // 10 - Сумма позиции со скидкой.
		СтрокаТаблицыТоваров.Добавить(1);                        // 11 - Номер налога (1).
		СтрокаТаблицыТоваров.Добавить(Позиция.СуммаНДС);         // 12 - Сумма налога (1).
		СтрокаТаблицыТоваров.Добавить(Позиция.НДС);              // 13 - Процент налога (1).
		СтрокаТаблицыТоваров.Добавить(0);                        // 14 - Номер налога (2).
		СтрокаТаблицыТоваров.Добавить(0);                        // 15 - Сумма налога (2).
		СтрокаТаблицыТоваров.Добавить(0);                        // 16 - Процент налога (2).
		СтрокаТаблицыТоваров.Добавить("");                       // 17 - Наименование секции форматирования товарной строки.
		
		ТаблицаТоваров.Добавить(СтрокаТаблицыТоваров);
	КонецЦикла;
	
	// Подготовка таблицы оплат.
	ТаблицаОплат = Новый Массив();
	
	СтрокаОплаты = Новый СписокЗначений();
	СтрокаОплаты.Добавить(0);
	СтрокаОплаты.Добавить(0);
	СтрокаОплаты.Добавить("");
	СтрокаОплаты.Добавить("");
	
	ТаблицаОплат.Добавить(СтрокаОплаты);
	
	// Подготовка таблицы общих параметров.
	ОбщиеПараметры = Новый Массив();
	ОбщиеПараметры.Добавить(0);                     //  1 - Тип чека.
	ОбщиеПараметры.Добавить(Истина);                //  2 - Признак фискального чека.
	ОбщиеПараметры.Добавить(Неопределено);          //  3 - Печать на подкладном документе.
	ОбщиеПараметры.Добавить(0);                     //  4 - Сумма по чеку без скидок/наценок.
	ОбщиеПараметры.Добавить(0);                     //  5 - Сумма по чеку с учетом всех скидок/наценок.
	ОбщиеПараметры.Добавить("");                    //  6 - Номер дисконтной карты.
	ОбщиеПараметры.Добавить("");                    //  7 - Текст шапки.
	ОбщиеПараметры.Добавить("");                    //  8 - Текст подвала.
	ОбщиеПараметры.Добавить(0);                     //  9 - Номер смены (для копии чека).
	ОбщиеПараметры.Добавить(0);                     // 10 - Номер чека (для копии чека).
	ОбщиеПараметры.Добавить(0);                     // 11 - Номер документа (для копии чека).
	ОбщиеПараметры.Добавить(0);                     // 12 - Дата документа (для копии чека).
	ОбщиеПараметры.Добавить("");                    // 13 - Имя кассира (для копии чека).
	ОбщиеПараметры.Добавить("");                    // 14 - Пароль кассира.
	ОбщиеПараметры.Добавить(0);                     // 15 - Номер шаблона.
	ОбщиеПараметры.Добавить("");                    // 16 - Наименование секции форматирования шапки.
	ОбщиеПараметры.Добавить("");                    // 17 - Наименование секции форматирования подвала.
	
	ВходныеПараметры.Добавить(ТаблицаТоваров);
	ВходныеПараметры.Добавить(ТаблицаОплат);
	ВходныеПараметры.Добавить(ОбщиеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетКассовойСменыБезГашенияНажатие(Элемент)
	
	// Отчет без гашения по ФР.
	Если ЗначениеЗаполнено(Объект.Касса) Тогда 
		
		ОтчетОТекущемСостоянииРасчетов();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбрана касса!";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОТекущемСостоянииРасчетов()
	
	ОчиститьСообщения();
	ЭтотОбъект.Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации,,,Объект.Касса);
	//МенеджерОборудованияКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор,,,Объект.Касса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаБУ1Нажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_бу_ОплатаБиллинговыхУслуг.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаБУНажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_бу_ОплатаБиллинговыхУслуг.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура РКО1Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		Форма = ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаСписка",,Элемент);
		Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("бит_КассаККМ");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Касса;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите кассу ККМ.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РКОНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		Форма = ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаСписка",,Элемент);
		Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("бит_КассаККМ");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Касса;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите кассу ККМ.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиККМ1Нажатие(Элемент)
	
	Форма = ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаСпискаУправляемая",,Элемент);
	
	ТекПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Ответсвенный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ответственный");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Ответсвенный;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиККМНажатие(Элемент)
	
	Форма = ОткрытьФорму("Документ.бит_ЧекККМ.Форма.ФормаСпискаУправляемая",,Элемент);
	
	ТекПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Ответсвенный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Эл = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ответственный");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Ответсвенный;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены2Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда 
		
		ОборудованиеПодключено = Истина;
		
		КоличествоФР = 0;
		
		Если ОборудованиеПодключено Тогда
			
			КоличествоФР = 1;
			
		КонецЕсли;	
		
		Отказ = Истина;	
		
		Если КоличествоФР = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для выбранной кассы не подключен фискальный регистратор";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		ИначеЕсли КоличествоФР = 1 Тогда
			
			Отказ = Ложь;
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			Заголовок = Элемент.Заголовок;
			
			ТаблицаЧековКоличество = ПолучитьТаблицуЧеков();
			
			Если ТаблицаЧековКоличество >0 тогда
				
				ТекстВопроса = "В базе присутствуют неархивированные чеки."+Символы.ПС+
				"Рекомендуется сначала создать документ ""Оплата КУ""."+Символы.ПС+
				" Создать его сейчас?";
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытиеКассовойСмены2НажатиеЗавершение1", ЭтотОбъект, Новый Структура("Отказ, ТекстВопроса, Заголовок", Отказ, ТекстВопроса, Заголовок)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				Возврат;
				
			Иначе
				
				ТекстВопроса = "Закрыть смену?";
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытиеКассовойСмены2НажатиеЗавершение1", ЭтотОбъект, Новый Структура("Отказ, ТекстВопроса, Заголовок", Отказ, ТекстВопроса, Заголовок)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				Возврат;
				
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбрана касса!";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены2НажатиеЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Отказ = ДополнительныеПараметры.Отказ;
	ТекстВопроса = ДополнительныеПараметры.ТекстВопроса;
	Заголовок = ДополнительныеПараметры.Заголовок;
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		Если мРазделитьОплату Тогда
			
			РазбитьОплатаКУПоДатамНаСервере(Отказ);
			
		Иначе
			
			СоздатьОплатаКУНаСервере(Отказ);
			
		КонецЕсли; 
		
		ОповеститьОбИзменении(Тип("ДокументСсылка.бит_ЧекККМ"));
		
		ЗакрытиеКассовойСмены2НажатиеФрагмент1(Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены2НажатиеФрагмент1(Знач Отказ, Знач Заголовок)
	
	Перем ЗакрытьСмену, ТекстВопроса;
	
	ЗакрытьСмену = НЕ Отказ;
	Если НЕ ЗакрытьСмену Тогда
		ТекстВопроса = "При создании документа ""Оплата КУ"" возникла ошибка."+Символы.ПС+
		"Все равно закрыть кассовую смену?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытиеКассовойСмены2НажатиеЗавершение", ЭтотОбъект, Новый Структура("Заголовок", Заголовок)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	Иначе
		ЗакрытиеКассовойСмены2НажатиеФрагмент(ЗакрытьСмену,Заголовок)	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены2НажатиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Заголовок = ДополнительныеПараметры.Заголовок;
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗакрытьСмену = ИСТИНА;
	Иначе
		ЗакрытьСмену = Ложь;
	КонецЕсли;
	
	ЗакрытиеКассовойСмены2НажатиеФрагмент(ЗакрытьСмену,Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеКассовойСмены2НажатиеФрагмент(Знач ЗакрытьСмену, Знач Заголовок)
	
	Если ЗакрытьСмену Тогда
		НапечататьЧек(Заголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияБУ1Нажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_бу_НачисленияПоБиллинговымУслугам.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияБУНажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_бу_НачисленияПоБиллинговымУслугам.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Инкассация1Нажатие(Элемент)
	
	РКОИнкассация(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ИнкассацияНажатие(Элемент)
	
	РКОИнкассация(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура РКОИнкассация(Элемент)	
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.Инкассация"));
		ПараметрыФормы.Вставить("бит_КассаККМ",Объект.Касса);
		
		Форма = ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента",Новый Структура("ЗаполнитьИзАРМКассира",ПараметрыФормы),Элемент);
		Форма.ВидОперацииПриИзмененииСервер();
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите кассу ККМ.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйЧекНажатие(Элемент)
	
	СоздатьНовыйЧек(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КассыККМНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Объект.Касса);
		
		ОткрытьФорму("Справочник.бит_КассыККМ.Форма.ФормаЭлементаУправляемая",ПараметрыФормы,Элемент);
		
	Иначе
		
		ОткрытьФорму("Справочник.бит_КассыККМ.Форма.ФормаСпискаУправляемая",,Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчета2Нажатие(Элемент)
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаСпискаУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныИзвещенийНажатие(Элемент)
	
	ОткрытьФорму("Справочник.бит_ШаблоныИзвещений.Форма.ФормаСпискаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_УслугиЖКХ4Нажатие(Элемент)
	
	ОткрытьФорму("Отчет.бит_ОтчетыПоКассе.Форма.ФормаОтчетаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОплатаКУНажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_ОплатаКУ.Форма.ФормаСпискаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВводПоказанийНажатие(Элемент)
	
	ОткрытьФорму("Документ.бит_ВводПоказанийПоСчетчикам.Форма.ФормаСпискаУправляемая",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",ВыбраннаяСтрока);
	
	Форма = ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаЭлементаУправляемая",ПараметрыФормы,Элемент);
	Форма.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	УстановкаОтбора(ЛицевыеСчета ,"Квартира" , Объект.Квартира);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Улица",Объект.Улица);
	ПараметрыФормы.Вставить("Здание",Объект.Здание);
	
	ФормаВыбор = ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбораУправляемая",Новый Структура("ОтборПоУлицеЗданию",ПараметрыФормы),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОтветственный(Команда)
	
	Элементы.ПанельПоискаОтветственный.Видимость = Истина;
	Элементы.ПанельПоискаАдрес.Видимость = Ложь;
	Элементы.ПанельПоискаЛицевойСчет.Видимость = Ложь;
	
	ЛицевыеСчета.Отбор.Элементы.Очистить();
	Элементы.ЛицевыеСчета.Обновить();
	
	ОтветсвенноеЛицо = "";
	Объект.Улица            = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка");
	Объект.Здание           = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
	Объект.Квартира         = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	ЛицевойСчет      = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветсвенноеЛицоПриИзменении(Элемент)
	ОтветсвенноеЛицоПриИзмененииНаСервере();
	
	Элементы.ЛицевыеСчета.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтветсвенноеЛицоПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ОтветсвенноеЛицо) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Наименование КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&Дата,
		|			ФизЛицо = &Физлицо
		|				И СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)) КАК бит_ПроживающиеПоЛССрезПоследних";
		
		
		Запрос.УстановитьПараметр("Дата"    , КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ФизЛицо" , ОтветсвенноеЛицо);
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "По данному Ответсвенному лицу не найдело лицевых счетов!";
			Сообщение.Сообщить();
			
		Иначе
			
			Результат = Запрос.Выполнить().Выгрузить();
			МасивЛС   = Результат.ВыгрузитьКолонку("ЛицевойСчет");
			
			СпискоЛС  = Новый СписокЗначений;
			СпискоЛС.ЗагрузитьЗначения(МасивЛС);
			
			ЛицевыеСчета.Отбор.Элементы.очистить();
			
			Эл = ЛицевыеСчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Наименование");
			Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
			Эл.ПравоеЗначение   = СпискоЛС;
			Эл.Использование    = ?(ЗначениеЗаполнено(СпискоЛС),Истина,Ложь);
			
			Если Эл.Использование Тогда
				
				Эл.ПравоеЗначение      = СпискоЛС;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОтветсвенноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мСписокФизЛиц = ОтветсвенноеЛицоНачалоВыбораНаСервере();
	
	Элементы.ОтветсвенноеЛицо.СписокВыбора.ЗагрузитьЗначения(мСписокФизЛиц);
	
КонецПроцедуры

&НаСервере
Функция ОтветсвенноеЛицоНачалоВыбораНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.Период) КАК Период,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> &Удален
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	Запрос.УстановитьПараметр("Дата"    , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Удален"    , ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан"));
	
	Если Запрос.Выполнить().Пустой() Тогда
		
	Иначе
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Сортировать("ЛицевойСчет Возр");
		
		Масив   = Результат.ВыгрузитьКолонку("ФизЛицо");
		
		мСписокФизЛиц  = Новый СписокЗначений;
		мСписокФизЛиц.ЗагрузитьЗначения(Масив);
		
	КонецЕсли; 
	
	Возврат Масив;
	
КонецФункции

&НаКлиенте
Процедура ПоискЛицевойСчет(Команда)
	
	Элементы.ПанельПоискаОтветственный.Видимость = Ложь;
	Элементы.ПанельПоискаАдрес.Видимость = Ложь;
	Элементы.ПанельПоискаЛицевойСчет.Видимость = Истина;
	
	ЛицевыеСчета.Отбор.Элементы.Очистить();
	Элементы.ЛицевыеСчета.Обновить();
	
	ОтветсвенноеЛицо = "";
	Объект.Улица            = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка");
	Объект.Здание           = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
	Объект.Квартира         = ПредопределенноеЗначение("Справочник.бит_Квартиры.ПустаяСсылка");
	ЛицевойСчет      = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	НаименованиеЛС = НаименованиеЛСНаСервере(ЛицевойСчет); 
	
	УстановкаОтбора(ЛицевыеСчета ,"Наименование" , НаименованиеЛС);
	
	Элементы.ЛицевыеСчета.Обновить();
	
КонецПроцедуры

&НаСервере
Функция НаименованиеЛСНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Наименование;
	
КонецФункции

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	УстановкаОтбораЧекККМ();	
	
	глКассаККМ = Объект.Касса;
	
КонецПроцедуры

#КонецОбласти
